# 1 задание
# a = float(input("Введите сторону квадрата: "))
#
# P = 4 * a
# print("Периметр квадрата равен: ",P)
#
# 2 задание
#
# a = float(input("Введите сторону квадрата: "))
# S = a ** 2
# print("Площадь квадрата равна: ",S)
#
# 3 задание
#
# a = float(input("Введите длину прямоугольника: "))
# b = float(input("Введите ширину прямоугольника: "))
# S = a * b
# P = 2 * (a + b)
# print("Площадь прямоугольника равна: ",S)
# print("Периметр прямоугольника равен: ",P)
#
# 4 задание
#
# d = float(input("Введите диаметр окружности: "))
# p = 3.14
# L = p * d
# print("Длина окружности равна: ", L)
#
# 5 задание
#
# a = float(input("Введите длину ребра куба: "))
# V = a ** 3
# S = 6 * a ** 2
# print("Объем куба равен: ", V)
# print("Площадь поверхности куба равна: ", S)
#
# 6 задание
# #
# a = float(input("Введите длину ребра прямоугольного параллелепипеда: "))
# b = float(input("Введите ширину ребра прямоугольного параллелепипеда: "))
# c = float(input("Введите высоту ребра прямоугольного параллелепипеда: "))
# V = a * b * c
# S = 2 * (a * b + b * c + a * c)
# print("Объем прямоугольного параллелепипеда равен: ", V)
# print("Площадь поверхности прямоугольного параллелепипеда равна: ", S)

# 7 задание
#
# R = float(input("Введите радиус окружности: "))
# p = 3.14
# L = 2 * p * R
# S = p * R ** 2
# print("Длина окружности равна: ", L)
# print("Площадь круга равна: ", S)

# 8 задание

# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
# c = (a + b) / 2
# print("Среднее арифметическое чисел равно: ", c)

# 9 задание

# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
#
# if a < 0 or b < 0:
#     print("Введите положительные числа: ")
#
# S = (a * b) ** 0.5
# print("Среднее геометрическое чисел равно: ", S)

# 10 задание

# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
#
# if a == 0 or b == 0:
#     print("Числа не должны быть равны нулю")
# else:
#     k_a = a**2
#     k_b = b**2
# print("Сумма квадратов равна: ", k_a+k_b)
# print("Разность квадратов равно: ", k_a-k_b)
# print("Произведение квадратов равно: ", k_a*k_b)
# print("Частность квадратов равно: ", k_a/k_b)