# 1 задание

# a = int(input("Введите число: "))
# print("Число положительное: ", a > 0)

# 2 задание

# a = int(input("Введите число: "))
# print("Число нечётное: ", a % 2 == 1)


# 3 задание

# a = int(input("Введите число: "))
# print("Число чётное: ", a % 2 == 0)

# 4 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Справедливы неравенства: ", a > 2 and b <= 3)

# 5 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Справедливы неравенства: ", a >= 0 and b < -2)

# 6 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третье число: "))
# print("Справедливо двойное неравенство: ", a < b < c)

# 7 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третье число: "))
# print("Число b посередине: ", a < b and b < c)

# 8 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Числа a и b нечетное: ", a % 2 == 1 and b % 2 == 1)

# 9 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Хотя бы одно из чисел нечетное: ", a % 2 == 1 or b % 2 == 1)

# 10 задание

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Ровно одно из чисел a и b нечетное: ", (a % 2 != 1 and b % 2 == 1) or (b % 2 != 1 and a % 2 == 1))