# 1 задание
# man = {
#     'Имя': 'Максим',
#     'Возраст': '21',
#     'Пол': 'Мужской',
#     'Рост': '178',
#     'Вес': '65',
#     'Размер ноги': '42'
# }

# 2 задание

# man = {
#     'Имя': 'Максим',
#     'Возраст': '21',
#     'Пол': 'Мужской',
#     'Рост': '178',
#     'Вес': '65',
#     'Размер ноги': '42'
# }
#
# print('Имя: ',man['Имя'])
# print('Возраст: ',man['Возраст'])
# print('Пол: ',man['Пол'])
# print('Рост: ',man['Рост'])
# print('Вес: ',man['Вес'])
# print('Размер ноги: ',man['Размер ноги'])

# 3 задание

# man = {
#     'Имя': 'Максим',
#     'Возраст': '21',
#     'Пол': 'Мужской',
#     'Рост': '178',
#     'Вес': '65',
#     'Размер ноги': '42'
# }
#
# man['Размер ноги: '] = '42'
#
# print(man)

# 4 задание

# man = {
#     'Имя': 'Максим',
#     'Возраст': '21',
#     'Пол': 'Мужской',
#     'Рост': '178',
#     'Вес': '65',
#     'Размер ноги': '42'
# }
# del man['Возраст']
#
# print(man)